tlaehdtlr/stm32-std/stm32F413ZGTx_bootloader/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BLE_UART_RX_Pin GPIO_PIN_6
#define BLE_UART_RX_GPIO_Port GPIOF
#define BLE_UART_TX_Pin GPIO_PIN_7
#define BLE_UART_TX_GPIO_Port GPIOF
#define BUTTON_Pin GPIO_PIN_1
#define BUTTON_GPIO_Port GPIOG
#define BUTTON_EXTI_IRQn EXTI1_IRQn
#define LED_GREEN_Pin GPIO_PIN_15
#define LED_GREEN_GPIO_Port GPIOE
#define LED_BLUE_Pin GPIO_PIN_11
#define LED_BLUE_GPIO_Port GPIOB
#define LED_RED_Pin GPIO_PIN_13
#define LED_RED_GPIO_Port GPIOB
#define MPU_UART4_TX_DEBUG_Pin GPIO_PIN_10
#define MPU_UART4_TX_DEBUG_GPIO_Port GPIOD
#define MPU_UART4_RX_DEBUG_Pin GPIO_PIN_0
#define MPU_UART4_RX_DEBUG_GPIO_Port GPIOD
#define BOOT1_Pin GPIO_PIN_12
#define BOOT1_GPIO_Port GPIOG
#define BLE_RF_RESET_Pin GPIO_PIN_14
#define BLE_RF_RESET_GPIO_Port GPIOG
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
